zephyrproject-rtos/hal_microchip/include/dt-bindings/sam/sam_d5x_e5x/same53/atsame53j20a-pinctrl.h
/*
 * Copyright (c) 2025 Microchip Technology Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Autogenerated file
 */

#ifndef MICROCHIP_ATSAME53J20A_PINCTRL_H_
#define MICROCHIP_ATSAME53J20A_PINCTRL_H_

#include <dt-bindings/sam/sam_d5x_e5x/common/mchp_pinctrl_pinmux_sam.h>

/* pa0_gpio */
#define PA0_GPIO MCHP_PINMUX(a, 0, gpio, gpio)

/* pa0a_eic_extint0 */
#define PA0A_EIC_EXTINT0 MCHP_PINMUX(a, 0, a, periph)

/* pa0d_sercom1_pad0 */
#define PA0D_SERCOM1_PAD0 MCHP_PINMUX(a, 0, d, periph)

/* pa0e_tc2_wo0 */
#define PA0E_TC2_WO0 MCHP_PINMUX(a, 0, e, periph)

/* pa1_gpio */
#define PA1_GPIO MCHP_PINMUX(a, 1, gpio, gpio)

/* pa1a_eic_extint1 */
#define PA1A_EIC_EXTINT1 MCHP_PINMUX(a, 1, a, periph)

/* pa1d_sercom1_pad1 */
#define PA1D_SERCOM1_PAD1 MCHP_PINMUX(a, 1, d, periph)

/* pa1e_tc2_wo1 */
#define PA1E_TC2_WO1 MCHP_PINMUX(a, 1, e, periph)

/* pa2_gpio */
#define PA2_GPIO MCHP_PINMUX(a, 2, gpio, gpio)

/* pa2a_eic_extint2 */
#define PA2A_EIC_EXTINT2 MCHP_PINMUX(a, 2, a, periph)

/* pa2b_adc0_ain0 */
#define PA2B_ADC0_AIN0 MCHP_PINMUX(a, 2, b, periph)

/* pa2b_dac_vout0 */
#define PA2B_DAC_VOUT0 MCHP_PINMUX(a, 2, b, periph)

/* pa3_gpio */
#define PA3_GPIO MCHP_PINMUX(a, 3, gpio, gpio)

/* pa3a_eic_extint3 */
#define PA3A_EIC_EXTINT3 MCHP_PINMUX(a, 3, a, periph)

/* pa3b_adc0_ain1 */
#define PA3B_ADC0_AIN1 MCHP_PINMUX(a, 3, b, periph)

/* pa3b_adc0_x0 */
#define PA3B_ADC0_X0 MCHP_PINMUX(a, 3, b, periph)

/* pa3b_adc0_y0 */
#define PA3B_ADC0_Y0 MCHP_PINMUX(a, 3, b, periph)

/* pa3b_adc0_vrefa */
#define PA3B_ADC0_VREFA MCHP_PINMUX(a, 3, b, periph)

/* pa4_gpio */
#define PA4_GPIO MCHP_PINMUX(a, 4, gpio, gpio)

/* pa4a_eic_extint4 */
#define PA4A_EIC_EXTINT4 MCHP_PINMUX(a, 4, a, periph)

/* pa4b_ac_ain0 */
#define PA4B_AC_AIN0 MCHP_PINMUX(a, 4, b, periph)

/* pa4b_adc0_ain4 */
#define PA4B_ADC0_AIN4 MCHP_PINMUX(a, 4, b, periph)

/* pa4b_adc0_x3 */
#define PA4B_ADC0_X3 MCHP_PINMUX(a, 4, b, periph)

/* pa4b_adc0_y3 */
#define PA4B_ADC0_Y3 MCHP_PINMUX(a, 4, b, periph)

/* pa4b_adc0_vrefb */
#define PA4B_ADC0_VREFB MCHP_PINMUX(a, 4, b, periph)

/* pa4d_sercom0_pad0 */
#define PA4D_SERCOM0_PAD0 MCHP_PINMUX(a, 4, d, periph)

/* pa4e_tc0_wo0 */
#define PA4E_TC0_WO0 MCHP_PINMUX(a, 4, e, periph)

/* pa4n_ccl_in0 */
#define PA4N_CCL_IN0 MCHP_PINMUX(a, 4, n, periph)

/* pa5_gpio */
#define PA5_GPIO MCHP_PINMUX(a, 5, gpio, gpio)

/* pa5a_eic_extint5 */
#define PA5A_EIC_EXTINT5 MCHP_PINMUX(a, 5, a, periph)

/* pa5b_ac_ain1 */
#define PA5B_AC_AIN1 MCHP_PINMUX(a, 5, b, periph)

/* pa5b_adc0_ain5 */
#define PA5B_ADC0_AIN5 MCHP_PINMUX(a, 5, b, periph)

/* pa5b_dac_vout1 */
#define PA5B_DAC_VOUT1 MCHP_PINMUX(a, 5, b, periph)

/* pa5d_sercom0_pad1 */
#define PA5D_SERCOM0_PAD1 MCHP_PINMUX(a, 5, d, periph)

/* pa5e_tc0_wo1 */
#define PA5E_TC0_WO1 MCHP_PINMUX(a, 5, e, periph)

/* pa5n_ccl_in1 */
#define PA5N_CCL_IN1 MCHP_PINMUX(a, 5, n, periph)

/* pa6_gpio */
#define PA6_GPIO MCHP_PINMUX(a, 6, gpio, gpio)

/* pa6a_eic_extint6 */
#define PA6A_EIC_EXTINT6 MCHP_PINMUX(a, 6, a, periph)

/* pa6b_ac_ain2 */
#define PA6B_AC_AIN2 MCHP_PINMUX(a, 6, b, periph)

/* pa6b_adc0_ain6 */
#define PA6B_ADC0_AIN6 MCHP_PINMUX(a, 6, b, periph)

/* pa6b_adc0_x4 */
#define PA6B_ADC0_X4 MCHP_PINMUX(a, 6, b, periph)

/* pa6b_adc0_y4 */
#define PA6B_ADC0_Y4 MCHP_PINMUX(a, 6, b, periph)

/* pa6b_adc0_vrefc */
#define PA6B_ADC0_VREFC MCHP_PINMUX(a, 6, b, periph)

/* pa6d_sercom0_pad2 */
#define PA6D_SERCOM0_PAD2 MCHP_PINMUX(a, 6, d, periph)

/* pa6e_tc1_wo0 */
#define PA6E_TC1_WO0 MCHP_PINMUX(a, 6, e, periph)

/* pa6i_sdhc0_sdcd */
#define PA6I_SDHC0_SDCD MCHP_PINMUX(a, 6, i, periph)

/* pa6n_ccl_in2 */
#define PA6N_CCL_IN2 MCHP_PINMUX(a, 6, n, periph)

/* pa7_gpio */
#define PA7_GPIO MCHP_PINMUX(a, 7, gpio, gpio)

/* pa7a_eic_extint7 */
#define PA7A_EIC_EXTINT7 MCHP_PINMUX(a, 7, a, periph)

/* pa7b_ac_ain3 */
#define PA7B_AC_AIN3 MCHP_PINMUX(a, 7, b, periph)

/* pa7b_adc0_ain7 */
#define PA7B_ADC0_AIN7 MCHP_PINMUX(a, 7, b, periph)

/* pa7b_adc0_x5 */
#define PA7B_ADC0_X5 MCHP_PINMUX(a, 7, b, periph)

/* pa7b_adc0_y5 */
#define PA7B_ADC0_Y5 MCHP_PINMUX(a, 7, b, periph)

/* pa7d_sercom0_pad3 */
#define PA7D_SERCOM0_PAD3 MCHP_PINMUX(a, 7, d, periph)

/* pa7e_tc1_wo1 */
#define PA7E_TC1_WO1 MCHP_PINMUX(a, 7, e, periph)

/* pa7i_sdhc0_sdwp */
#define PA7I_SDHC0_SDWP MCHP_PINMUX(a, 7, i, periph)

/* pa7n_ccl_out0 */
#define PA7N_CCL_OUT0 MCHP_PINMUX(a, 7, n, periph)

/* pa8_gpio */
#define PA8_GPIO MCHP_PINMUX(a, 8, gpio, gpio)

/* pa8a_eic_nmi */
#define PA8A_EIC_NMI MCHP_PINMUX(a, 8, a, periph)

/* pa8b_adc0_ain8 */
#define PA8B_ADC0_AIN8 MCHP_PINMUX(a, 8, b, periph)

/* pa8b_adc0_x6 */
#define PA8B_ADC0_X6 MCHP_PINMUX(a, 8, b, periph)

/* pa8b_adc0_y6 */
#define PA8B_ADC0_Y6 MCHP_PINMUX(a, 8, b, periph)

/* pa8b_adc1_ain2 */
#define PA8B_ADC1_AIN2 MCHP_PINMUX(a, 8, b, periph)

/* pa8c_sercom0_pad0 */
#define PA8C_SERCOM0_PAD0 MCHP_PINMUX(a, 8, c, periph)

/* pa8d_sercom2_pad1 */
#define PA8D_SERCOM2_PAD1 MCHP_PINMUX(a, 8, d, periph)

/* pa8e_tc0_wo0 */
#define PA8E_TC0_WO0 MCHP_PINMUX(a, 8, e, periph)

/* pa8f_tcc0_wo0 */
#define PA8F_TCC0_WO0 MCHP_PINMUX(a, 8, f, periph)

/* pa8g_tcc1_wo4 */
#define PA8G_TCC1_WO4 MCHP_PINMUX(a, 8, g, periph)

/* pa8h_qspi_data0 */
#define PA8H_QSPI_DATA0 MCHP_PINMUX(a, 8, h, periph)

/* pa8i_sdhc0_sdcmd */
#define PA8I_SDHC0_SDCMD MCHP_PINMUX(a, 8, i, periph)

/* pa8j_i2s_mck0 */
#define PA8J_I2S_MCK0 MCHP_PINMUX(a, 8, j, periph)

/* pa8n_ccl_in3 */
#define PA8N_CCL_IN3 MCHP_PINMUX(a, 8, n, periph)

/* pa9_gpio */
#define PA9_GPIO MCHP_PINMUX(a, 9, gpio, gpio)

/* pa9a_eic_extint9 */
#define PA9A_EIC_EXTINT9 MCHP_PINMUX(a, 9, a, periph)

/* pa9b_adc0_ain9 */
#define PA9B_ADC0_AIN9 MCHP_PINMUX(a, 9, b, periph)

/* pa9b_adc0_x7 */
#define PA9B_ADC0_X7 MCHP_PINMUX(a, 9, b, periph)

/* pa9b_adc0_y7 */
#define PA9B_ADC0_Y7 MCHP_PINMUX(a, 9, b, periph)

/* pa9b_adc1_ain3 */
#define PA9B_ADC1_AIN3 MCHP_PINMUX(a, 9, b, periph)

/* pa9c_sercom0_pad1 */
#define PA9C_SERCOM0_PAD1 MCHP_PINMUX(a, 9, c, periph)

/* pa9d_sercom2_pad0 */
#define PA9D_SERCOM2_PAD0 MCHP_PINMUX(a, 9, d, periph)

/* pa9e_tc0_wo1 */
#define PA9E_TC0_WO1 MCHP_PINMUX(a, 9, e, periph)

